// import 'package:belleza/feature/view/Screen_Salon/widgets/top_salon_screen.dart';
// import 'package:flutter_screenutil/flutter_screenutil.dart';
// import 'package:flutter/material.dart';
// import 'widgets/about_item.dart';

// class AboutScreen extends StatelessWidget {
//   @override
//   Widget build(BuildContext context) {
//     return Scaffold(
//       body: Column(
//         children: [
//           TopSalonScreen(
//             title: 'حول التطبيق',
//             searchWidget: false,
//             back: true,
//           ),
//           SizedBox(
//             height: 8.h,
//           ),
//           AboutItem(
//             title: 'الرؤية',
//             subTitle:
//                 ''' حول التطبيق معلومات عن التطبيق و مالكيه   حول التطبيق معلومات عن التطبيق
//  و مالكيه  حول التطبيق معلومات عن التطبيق و مالكيه  حول التطبيق معلومات 
// عن التطبيق و مالكيه  حول التطبيق معلومات عن التطبيق و مالكيه  حول التطبيق 
// معلومات عن التطبيق و مالكيه  ''',
//           ),
//           AboutItem(
//             title: 'الرؤية',
//             subTitle:
//                 ''' حول التطبيق معلومات عن التطبيق و مالكيه   حول التطبيق معلومات عن التطبيق
//  و مالكيه  حول التطبيق معلومات عن التطبيق و مالكيه  حول التطبيق معلومات 
// عن التطبيق و مالكيه  حول التطبيق معلومات عن التطبيق و مالكيه  حول التطبيق 
// معلومات عن التطبيق و مالكيه  ''',
//           ),
//           AboutItem(
//             title: 'الرسالة',
//             subTitle:
//                 ''' حول التطبيق معلومات عن التطبيق و مالكيه   حول التطبيق معلومات عن التطبيق
//  و مالكيه  حول التطبيق معلومات عن التطبيق و مالكيه  حول التطبيق معلومات 
// عن التطبيق و مالكيه  حول التطبيق معلومات عن التطبيق و مالكيه  حول التطبيق 
// معلومات عن التطبيق و مالكيه  ''',
//           ),
//           AboutItem(
//             title: 'الأهداف',
//             subTitle:
//                 ''' حول التطبيق معلومات عن التطبيق و مالكيه   حول التطبيق معلومات عن التطبيق
//  و مالكيه  حول التطبيق معلومات عن التطبيق و مالكيه  حول التطبيق معلومات 
// عن التطبيق و مالكيه  حول التطبيق معلومات عن التطبيق و مالكيه  حول التطبيق 
// معلومات عن التطبيق و مالكيه  ''',
//           ),
//         ],
//       ),
//     );
//   }
// }
